documentation/glint/Glint.docset/Contents/Resources/Documents/ffi.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-22 Sun 09:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Foreign Function Interface</title>
<meta name="author" content="Lens_r" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="all.css">
</head>
<body>
<div id="content" class="content">
<div id="outline-container-foreign-function-interface" class="outline-2">
<h2 id="foreign-function-interface"><span class="section-number-2">1.</span> Foreign Function Interface</h2>
<div class="outline-text-2" id="text-foreign-function-interface">
</div>
<div id="outline-container-declaring-external-functions" class="outline-3">
<h3 id="declaring-external-functions"><span class="section-number-3">1.1.</span> Declaring External Functions</h3>
<div class="outline-text-3" id="text-declaring-external-functions">
<p>
Calling functions defined in other languages from Glint (and vice versa).
</p>

<p>
In Glint, you can declare a function without defining it using <code>external</code>.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; declared in C's stdio.h</span>
<span class="org-keyword">external</span> <span class="org-function-name">putchar</span> <span class="org-operator">:</span> <span class="org-type">cint</span><span class="org-delimiter">(</span>ch <span class="org-operator">:</span> <span class="org-type">cint</span><span class="org-delimiter">)</span>;
</pre>
</div>

<p>
Equivalent in C/C++:
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Declared in C's stdio.h
</span><span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-type">int</span> <span class="org-function-name">putchar</span>(<span class="org-type">int</span> <span class="org-variable-name">ch</span>);
</pre>
</div>

<p>
Equivalent in LLVM IR:
</p>
<div class="org-src-container">
<pre class="src src-llvm">declare external i32 @putchar (i32 %0)
</pre>
</div>

<p>
Use of an external function is dictated by the declared type, just like a defined function. If the declared type of the function doesn't match the actual function's implementation, errors that are hard to debug may occur, differing across calling conventions.
</p>
</div>
</div>
<div id="outline-container-defining-functions-for-external-use" class="outline-3">
<h3 id="defining-functions-for-external-use"><span class="section-number-3">1.2.</span> Defining Functions for External Use</h3>
<div class="outline-text-3" id="text-defining-functions-for-external-use">
<p>
Glint may define functions that are then called from another language. Actually, any Glint function may be called from another language, but, there are language features to make it easier.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-function-name">my_glint_function</span> <span class="org-operator">:</span> <span class="org-type">cint</span><span class="org-delimiter">()</span> <span class="org-keyword">nomangle</span>
  <span class="org-number">69</span>;
</pre>
</div>

<p>
The <code>nomangle</code> function attribute specifies that the function signature should not be encoded into the function name (such as to allow for overloading); this means other languages don't have to use an esoteric, mangled function name: WYSIWYG.
</p>

<p>
From C, the above function could be called like (assuming both Glint and C programs are built and linked to form a single binary).
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="org-keyword">extern</span> <span class="org-type">int</span> <span class="org-function-name">my_glint_function</span>();

<span class="org-type">int</span> <span class="org-function-name">my_c_function</span>() {
  <span class="org-keyword">return</span> my_glint_function();
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
